perf/availability.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    gunicorn_multi:
      target: 'http://localhost:5555/gunicorn_multi'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn_multi"
    gunicorn_gevent:
      target: 'http://localhost:5555/gunicorn_gevent'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn_gevent"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 120

scenarios:
  - name: "intensive"
    weight: 5
    flow:
    - get:
        url: "/intensive"
  - name: "timeout"
    weight: 40
    flow:
    - get:
        url: "/timeout"
  - name: "ping"
    weight: 55
    flow:
    - get:
        url: "/"