perf/availability.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    gunicorn_multi:
      target: 'http://localhost:5555/gunicorn_multi'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn_multi"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - duration: 20
      arrivalRate: 5

scenarios:
  - name: normal
    flow:
    - get:
        url: "/intensive"