perf/performance_timeout.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    gunicorn_multi:
      target: 'http://localhost:5555/gunicorn_multi'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn_multi"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - pause: 5
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 35
    - name: Plain
      duration: 60
      arrivalRate: 35
    - pause: 20

scenarios:
  - name: "timeout"
    flow:
    - get:
        url: "/timeout"