perf/response-time-bbox.yaml
config:
  environments:
    bbox-1:
      target: 'http://localhost:5555/bbox-1'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox-1"
    bbox-2:
      target: 'http://localhost:5555/bbox-2'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-bbox-2"


  pool: 1 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 100
      arrivalRate: 1
    

scenarios:
  - name: root (/)
    flow:
      - get:
          url: '/'